Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator
The Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator class is a wrapper class for enumerating an instance of Tekla.Structures.Model.ModelObjectEnumerator.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.enumerator
The enumerator.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.#ctor(System.Collections.IEnumerator)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator class.
enumerator: The enumerator.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.Current
Gets the current object.
The current object.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.System#Collections#IEnumerator#Current
Gets the current object.
The current object.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.GetEnumerator
Gets the enumerator.
Returns: The enumerator.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through a collection.
Returns:
An System.Collections.IEnumerator object that can be used to iterate through the collection.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.MoveNext
Advances the enumerator to the next element of the collection.
Returns:
True if the enumerator was successfully advanced to the next element;
false if the enumerator has passed the end of the collection.
Throws System.InvalidOperationException:
Thrown when the collection was modified after the enumerator was created.

Tekla.Structures.DirectManipulation.Model.ObjectDescriptionEnumerator.Reset
Sets the enumerator to its initial position, which is before the first element in the collection.
Throws System.InvalidOperationException:
Thrown when the collection was modified after the enumerator was created.